In [1]:
import pandas as pd

In [4]:
import pandas as pd

india_weather = pd.DataFrame({
    "city": ["mumbai","delhi","bangalore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})
india_weather

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78

In [5]:
us_weather = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [6]:
pd.concat([india_weather, us_weather])

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78
0   new york           21        68
1    chicago           14        65
2    orlando           35        75

In [7]:
pd.concat([india_weather, us_weather], ignore_index=True) # for coninuous index

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78
3   new york           21        68
4    chicago           14        65
5    orlando           35        75

In [12]:
df = pd.concat([india_weather, us_weather], keys=['India', 'US']) # Associate key for each but remove ignore_index

In [13]:
df.loc['India']

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78

In [14]:
df.loc['US']

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

# concat based on column

In [27]:
temp_df = pd.DataFrame({
    "city": ["mumbai","delhi","bangalore"],
    "temperature": [32,45,30]})
temp_df

        city  temperature
0     mumbai           32
1      delhi           45
2  bangalore           30

In [28]:
windspeed_df = pd.DataFrame({
    "city": ["delhi","bangalore","mumbai"],
    "windspeed": [15,10,20]})
windspeed_df

        city  windspeed
0      delhi         15
1  bangalore         10
2     mumbai         20

In [23]:
df = pd.concat([temp_df, windspeed_df])

In [24]:
df

        city  temperature  windspeed
0     mumbai         32.0        NaN
1      delhi         45.0        NaN
2  bangalore         30.0        NaN
0     mumbai          NaN       15.0
1      delhi          NaN       10.0
2  bangalore          NaN       20.0

In [29]:
df = pd.concat([temp_df, windspeed_df], axis=1)

In [30]:
df

        city  temperature       city  windspeed
0     mumbai           32      delhi         15
1      delhi           45  bangalore         10
2  bangalore           30     mumbai         20

In [31]:
temp_df = pd.DataFrame({
    "city": ["mumbai","delhi","bangalore"],
    "temperature": [32,45,30]})
temp_df

        city  temperature
0     mumbai           32
1      delhi           45
2  bangalore           30

In [32]:
windspeed_df = pd.DataFrame({
    "city": ["delhi","bangalore","mumbai"],
    "windspeed": [15,10,20]})
windspeed_df

        city  windspeed
0      delhi         15
1  bangalore         10
2     mumbai         20